/*
常用正则表达式
链接：https://juejin.im/post/5aed6da16fb9a07aac2457f6
*/
//第二代身份证号码正则
let isChineseID2 = /^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/
//第一代身份证正则表达式(15位)
let isChineseID1 = /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/
////用户名正则，4到16位（字母，数字，下划线，减号）
let isUserName = /^[a-zA-Z0-9_-]{4,16}$/
//密码正则，以字母开头，长度在6~18之间，只能包含字母、数字和下划线
let isPassword = /^[a-zA-Z]\w{5,17}$/
//强密码正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
let isStrongPassword = /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/
// qq号正则
let isQQ = /^[1-9][0-9]{4,10}$/
//微信号正则，6至20位，以字母开头，字母，数字，减号，下划线
let isWechat = /^[a-zA-Z]([-_a-zA-Z0-9]{5,19})+$/
//特殊字符检测正则:
let isSpecialCharacters = /["'<>%;)(&+]+-!！@#$~/
// 域名正则
let isDomain = /[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+\.?/
// 车牌号码正则
let isLicensePlateNumber = /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/
// 包含中文正则	
let isChinese = /[\u4E00-\u9FA5]/
// 护照正则
let isPassport = /^(P\d{7}|G\d{7,8}|TH\d{7,8}|S\d{7,8}|A\d{7,8}|L\d{7,8}|\d{9}|D\d+|1[4,5]\d{7})$/
// IP地址正则
let isIP = /\d+\.\d+\.\d+\.\d+/
//经度正则
let isLongitude = /^(\-|\+)?(((\d|[1-9]\d|1[0-7]\d|0{1,3})\.\d{0,6})|(\d|[1-9]\d|1[0-7]\d|0{1,3})|180\.0{0,6}|180)$/
//纬度正则
let isLatitude = /^(\-|\+)?([0-8]?\d{1}\.\d{0,6}|90\.0{0,6}|[0-8]?\d{1}|90)$/
// 某个固定域名
let someDomain = /^https?:\/\/.+\.qtrade\.com\.cn\/.+$/

/*
  动态正则表达式，参数正则表达式
  let reg1 = new RegExp('^' + delimiter + '([\\s\\S]*)$', 'g')
    let reg2 = new RegExp('^([\\s\\S]*)' + delimiter + '$', 'g')
    title = title.replace(reg1, '$1').replace(reg2, '$1')
*/